const String aboutUsImage1 =
    'https://bespareshbema.com/assets/images/aboutus/1.png';
const String aboutUsImage2 =
    'https://bespareshbema.com/assets/images/aboutus/2.png';
const String aboutUsImage3 = 'https://bespareshbema.com/assets/images/Site.png';

const String aboutUsIcon1 =
    'https://bespareshbema.com/assets/images/home/guarantee-certificate.png';
const String aboutUsIcon2 =
    'https://bespareshbema.com/assets/images/home/speech-bubble.png';
const String aboutUsIcon3 =
    'https://bespareshbema.com/assets/images/home/rating.png';
const String aboutUsIcon4 =
    'https://bespareshbema.com/assets/images/home/place.png';
const String aboutUsIcon5 =
    'https://bespareshbema.com/assets/images/home/technician.png';

const String aboutUsParagraph1 =
    'این روزها که خیلی‌هامون سرمون شلوغه و وقت نداریم برای خدمات مختلف، دنبال متخصص حرفه‌ای و قابل اعتماد بگردیم، نیاز به یه پلتفرم مطمئن داریم که بتونیم توی هر زمان و هر مکانی، خدمات مورد نیازمون رو به شکل حرفه‌ای دریافت کنیم. بسپارش به ما یه پلتفرم جامعه که برای خدمات تخصصی برق ساختمان کنار شما حضور داره. مجموعه‌ی ما به عنوان رابط بین شما و کارشناس‌های متخصص عمل می‌کنه و بهترین نیروها رو برای خدمات مورد نیاز شما در نظر می‌گیره.';
const String aboutUsParagraph2 =
    'بسپارش به ما یه پلتفرم جامع برای خدمات آنلاین برق ساختمانه و خدمات در محل رو با بالاترین کیفیت به شما کاربرای عزیز ارائه می‌ده. خدمات ما شامل :\n'
    'عیب‌یاب برق ساختمان و افت ولتاژ\n'
    'اعلام حریق\n'
    'نصب و تعمیر و راه‌اندازی کولر\n'
    'چراغ و سنسور\n'
    'خدمات آیفون‌های صوتی تصویری و کدینگ\n'
    'برق اظطراری\n'
    'دوربین مدار بسته\n'
    'محافظ ساختمان\n'
    'تلفن و سانترال\n'
    'نصب آنتن های معملوی و مرکزی\n'
    'سیستم ارت\n'
    'نصب و تعویض\n'
    'کلید پریز و جعبه فیوز\n'
    'و ...\n'
    'می‌شه. یعنی همون‌طور که از اسممون می‌شه حدس زد، شما می‌تونی تمام خدمات برق‌کاری خونه، محل کار یا هر مکانی که مدنظر داری رو بسپاریش به ما.';

const String aboutUsItem1 =
    'ما هم برای کیفیت خدماتمون تضمین می‌دیم و هم در مورد قطعات و وسایلی که کارشناس‌هامون استفاده می‌کنن. یعنی با خیال راحت نه فقط خودِ کار، بلکه بعدش رو هم بسپارینش به ما. در ضمن این رو هم بگیم که بسپارش به ما هوای مشتری‌های وفادارش رو هم داره و انواع کد تخفیف و پروموشن‌ها رو براشون در نظر می‌گیره.';
const String aboutUsItem2 =
    'میدونی فرق ما با بقیه چیه؟! وقتی که می‌خوای سفارشت رو ثبت کنی، با سوالاتی که در مورد خدمات مورد نظر ازت می‌پرسیم، قیمت نهایی کار رو برآورد و بهت اعلام می‌کنیم. با این روش از همون اول می‌دونی که قراره چقدر هزینه کنی و دیگه از این بابت خیالت راحته.';
const String aboutUsItem3 =
    'ما از زمان ثبت سفارش تا وقتی که کارشناس کار رو بهتون تحویل بده، ممکنه سوالی براتون پیش بیاد یا نیاز به راهنمایی داشته باشین. اینجاست که بخش پشتیبانی ما وارد عمل می‌شه، فقط کافیه از راه‌های ارتباطی مختلف مثل تلفن یا پیامک با ما تماس بگیرین.';
const String aboutUsItem4 =
    'وسایل برقی توی هر روز و هر ساعتی ممکنه از کار بیفتن یا خراب بشن! کارشناس‌های ما هم می‌تونن هروقت که شما به مشکل برخوردین در محل شما حاضر بشن و مشکلتون رو حل کنن. حتی توی روزهای تعطیل و آخر هفته‌ها هم می‌تونین روی کمک ما حساب کنین.';
const String aboutUsItem5 =
    'ما برای استخدام کارشناس‌هامون، اون‌ها رو از فیلترهای مختلفی رد می‌کنیم تا مطمئن باشیم که هم از نظر اخلاقی بهترین هستن و هم از نظر حرفه‌ای. برای اینکه بتونیم توی اون زمانی که مهمون شما هستیم بهترین خدمات رو ارائه بدیم، ازتون می‌خوایم که بعد از حضور کارشناس و انجام شدن کار، در مورد کیفیت کار و برخورد کارشناس به سوال‌های نظرسنجی ما پاسخ بدین و برای اینکه بتونیم رضایت شما رو جلب کنیم، بهمون کمک کنین.';

List<Map<String, Map<String, String>>> aboutUsContent = [
  {
    'بسپارش به ما چیکار می کنه؟': {aboutUsImage1: aboutUsParagraph1}
  },
  {
    'در بسپارش به ما چه خدماتی ارائه می شه؟': {aboutUsImage2: aboutUsParagraph2}
  },
  {
    'چرا بسپارش به ما؟': {aboutUsImage3: ''}
  },
  {
    'تضمین و گارانتی خدمات و کالا': {aboutUsIcon1: aboutUsItem1}
  },
  {
    'مشخص شدن قیمت نهایی با چند کلیک': {aboutUsIcon2: aboutUsItem2}
  },
  {
    'مشاوره و پشتیبانی تلفنی': {aboutUsIcon3: aboutUsItem3}
  },
  {
    'انتخاب زمان و مکان با شما': {aboutUsIcon4: aboutUsItem4}
  },
  {
    'کارشناس‌های بااخلاق و حرفه‌ای': {aboutUsIcon5: aboutUsItem5}
  },
];
