import 'package:bpbm2/common/constants.dart';

const String privacyHeaderText = ' حریم خصوصی کاربران بسپارش به ما';

const String privacyHeaderImage =
    '$baseAssetUrl/images/privacy_policy2%201.png';

const String privacyParagraph =
    'مشتری گرامی،شما برای دریافت خدمات از طریق پلتفرم‌های آنلاین، باید اطلاعات شخصی خودتون مثل اسم، آدرس و شماره تلفن رو توی سایت یا اپلیکیشن وارد کنین. درواقع شما با ثبت کردن اطلاعاتتون توی سایت ما، صحت اون‌ها رو تأیید می‌کنین. ما هم از طریق همین اطلاعات برای ارائه خدمات به شما باهاتون در تماس هستیم. تمام اطلاعات شما فقط با حکم قانونی در اختیار مراجع ذی‌صلاح قرار داده می‌شه و ما به شما تعهد می‌دیم که اطلاعاتتون پیش ما محفوظه و حریم شخصی‌تون رعایت می‌شه. در صورتی که نظر یا پیام ارسالی کاربرها مشمول مصادیق محتوای مجرمانه باشه، بسپارش به ما از اطلاعات ثبت شده برای پیگیری قانونی استفاده می‌کنه. درضمن، بسپارش به ما توی همه‌ی فعالیت‌هاش از قوانین تجارت الکترونیک تبعیت می‌کنه، بنابراین قانون هم روی تعهد ما به شما نظارت داره.';

const String privacyFooter =
    'برای آشنایی بیشتر می تونید بخش قوانین و مقررات ما رو هم مطالعه کنید . تیم بسپارش به ما تمامی اصطلاحات و مواردی رو که لازمه در مورد ما و نحوه کار ما بدونید رو توضیح داده و با مطالعه اون مطلب می تونید باسخ سوالات حقوقی خودتون رو در مورد کسب و کار ما پیدا کنید';
